# Concatinate Data Frames

In [1]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  humidity  temperature
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [3]:
#concate two dataframes
df = pd.concat([india_weather, us_weather])
df

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [4]:
#if you want continuous index
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
3  new york        68           21
4   chicago        65           14
5   orlando        75           35

#For more details about concat

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html

In [5]:
#For additional index
df = pd.concat([india_weather, us_weather], keys=['india', 'us'])
df

             city  humidity  temperature
india 0    mumbai        80           32
      1     delhi        60           45
      2  banglore        78           30
us    0  new york        68           21
      1   chicago        65           14
      2   orlando        75           35

In [6]:
df.loc['india']

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30

In [7]:
df.loc['us']

       city  humidity  temperature
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [8]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30]})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [12]:
humidity_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "humidity": [68, 65, 75]})
humidity_df

       city  humidity
0    mumbai        68
1     delhi        65
2  banglore        75

In [13]:
#concate two dataframes
df = pd.concat([temperature_df, humidity_df])
df

       city  humidity  temperature
0    mumbai       NaN         32.0
1     delhi       NaN         45.0
2  banglore       NaN         30.0
0    mumbai      68.0          NaN
1     delhi      65.0          NaN
2  banglore      75.0          NaN

In [14]:
#suppose if you don't want create seperate rows then use parameter axis
df = pd.concat([temperature_df, humidity_df], axis=1)
df

       city  temperature      city  humidity
0    mumbai           32    mumbai        68
1     delhi           45     delhi        65
2  banglore           30  banglore        75

In [15]:
#suppose order of cities changes
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "humidity": [68, 65, 75]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [16]:
df = pd.concat([temperature_df, humidity_df], axis=1)
df

       city  temperature      city  humidity
0    mumbai           32     delhi        68
1     delhi           45    mumbai        65
2  banglore           30  banglore        75

In [17]:
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "humidity": [68, 65, 75]}, index=[1, 0, 2])
humidity_df

       city  humidity
1     delhi        68
0    mumbai        65
2  banglore        75

In [18]:
df = pd.concat([temperature_df, humidity_df], axis=1)
df

       city  temperature      city  humidity
0    mumbai           32    mumbai        65
1     delhi           45     delhi        68
2  banglore           30  banglore        75

In [19]:
#we can also join dataframes using series
s = pd.Series(["Humid", 'Dry', 'Rain'], name='event')
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object